module.exports = function (num) {
    let h = Math.floor(num / 100)
    let to = num % 100
    let t = Math.floor(to / 10)
    let o = num % 10
    if (to < 20)
        return `${hundreds[h]}${ones[to]}`
    else
        return `${hundreds[h]}${tens[t]}${ones[o]}`

}


let ones = [
    ``,
    `один`,
    `два`,
    `три`,
    `четыре`,
    `пять`,
    `шесть`,
    `семь`,
    `восемь`,
    `девять`,
    `десять`,
    `одиннадцать`,
    `двенадцать`,
    `тринадцать`,
    `четырнадцать`,
    `пятнадцать`,
    `шестнадцать`,
    `семнадцать`,
    `восемнадцать`,
    `девятнадцать`,
]

let tens = [
    ``,
    ``,
    `двадцать `,
    `тридцать `,
    `сорок `,
    `пятьдесят `,
    `шестьдесят `,
    `семьдесят `,
    `восемьдесят `,
    `девяносто `,
]

let hundreds = [
    ``,
    `сто `,
    `двести `,
    `триста `,
    `четыреста `,
    `пятьсот `,
    `шестьсот `,
    `семьсот `,
    `восемьсот `,
    `девятьсот `,
]